/*********************************************************************************************************************
 * @file            delay.c
 * @brief           延时函数
 * @author          HeFei WeiHuang
 * @version         1.0
 * @Target core     CH32V103R8T6
 * @date            2021-10-06
 ********************************************************************************************************************/

#include "delay.h"

/* 全局变量声明 */
static uint8_t  p_us=0;
static uint16_t p_ms=0;

//-------------------------------------------------------------------------------------------------------------------
//  @brief      延时初始化
//  @param      void
//  @return     void
//  Sample usage:           Delay_Init();
//-------------------------------------------------------------------------------------------------------------------
void Delay_Init(void)
{
    p_us=sys_clk/8000000;
    p_ms=(uint16_t)p_us*1000;
}

//-------------------------------------------------------------------------------------------------------------------
//  @brief      us级延时
//  @param      n           延时的时间（us）
//  @return     void
//  Sample usage:           Delay_Us(1000);//延时1000us
//-------------------------------------------------------------------------------------------------------------------
void Delay_Us(uint32_t n)
{
    uint32_t i;

    SysTick->CTLR = 0;
    i = (uint32_t)n*p_us;

    SysTick->CNTL0 = 0;
    SysTick->CNTL1 = 0;
    SysTick->CNTL2 = 0;
    SysTick->CNTL3 = 0;
    SysTick->CTLR = 1;

  while((*(__IO uint32_t*)0xE000F004) <= i);

}

//-------------------------------------------------------------------------------------------------------------------
//  @brief      ms级延时
//  @param      n           延时的时间（ms）
//  @return     void
//  Sample usage:           Delay_Ms(1000);//延时1000ms
//-------------------------------------------------------------------------------------------------------------------
void Delay_Ms (uint32_t n)
{
    uint32_t i;

    SysTick->CTLR = 0;
    i = (uint32_t)n*p_ms;

    SysTick->CNTL0 = 0;
    SysTick->CNTL1 = 0;
    SysTick->CNTL2 = 0;
    SysTick->CNTL3 = 0;
    SysTick->CTLR = 1;

  while((*(__IO uint32_t*)0xE000F004) <= i);
}
