/*********************************************************************************************************************
* @file            car_init.h
* @brief           智能车系统初始化
* @author          Davis Klay HF
* @version         1.0
* @Target core     GD32E230C8T6
* @date            2021-10-07
********************************************************************************************************************/

#ifndef __CAR_INIT_H
#define __CAR_INIT_H

#include "headfile.h"

/* 函数声明 */

/* 外部函数，用户可自行调用 */
/* 智能车初始化 */
void car_init();

#endif
