/*********************************************************************************************************************
* @file            car_uart.c
* @author          Andreas HF
* @Target core     CH32V103R8T6
* @revisions       -2021.10.22, V1.0
* @modify          none
********************************************************************************************************************/

#include "car_uart.h"

//-------------------------------------------------------------------------------------------------------------------
// @brief        串口1初始化
// @return       void
// Sample usage:        uart1_init(UART_1);//串口1初始化
//-------------------------------------------------------------------------------------------------------------------
void uart1_init(unsigned int uart_periph)
{
    uart_init(UART_1, 115200, UART1_TX_A9, UART1_RX_A10);
}

//-------------------------------------------------------------------------------------------------------------------
// @brief        串口2初始化
// @return       void
// Sample usage:        uart2_init(UART_2);//串口2初始化
//-------------------------------------------------------------------------------------------------------------------
void uart2_init(unsigned int uart_periph)
{
    uart_init(UART_2, 115200, UART2_TX_A2, UART2_RX_A3);
}

//-------------------------------------------------------------------------------------------------------------------
// @brief        串口接收数
// @param        uart_periph            串口模块号：USARTx(x = 1,2)
// @return       rec_dat
// Sample usage:        rx_char = uart_receive(UART1);//串口1接收数
//-------------------------------------------------------------------------------------------------------------------
unsigned char uart_receive(unsigned int uart_periph)
{
    unsigned char rec_dat;

    rec_dat = uart_getchar(uart_periph);

    return rec_dat;
}

//-------------------------------------------------------------------------------------------------------------------
// @brief        串口发送字符
// @param        uart_periph              串口模块号：USARTx(x = 1,2)
// @param        dat                      需要发送的字节
// @return       void
// Sample usage:        uart_send_char(UART_1,0xA5);// 串口UART1发送0xA5
//-------------------------------------------------------------------------------------------------------------------
void uart_send_char(unsigned int uart_periph, unsigned char dat)
{
    uart_putchar(uart_periph, dat);
}
