/*********************************************************************************************************************
 * @file            car_led_display.c
 * @author          HeFei
 * @version         1.0
 * @Target core     CH32V103R8T6
 * @date            2021-10-07
 ********************************************************************************************************************/

#include "car_led_display.h"

//-------------------------------------------------------------------------------------------------------------------
// @brief        点亮数码管
// @return       void
// Sample usage:             leddisplay_on(zero, one, two, three); //数码管从左到右分别显示0,1,2,3
//-------------------------------------------------------------------------------------------------------------------
void led_display_on(uint8 char1, uint8 char2, uint8 char3, uint8 char4)
{
    /* 写命令，设置地址自动加一 */
    tm1637_command(0x40);

    /* 发送首地址和四位数码管显示值 */
    tm1637_data(0XC0, char1, char2, char3, char4);

    /* 写命令，开显示 */
    tm1637_command(0x8F);   //设置显示脉冲为14/16
}
