/*********************************************************************************************************************
 * @file            car_ultrasonic.c
 * @brief           ³¬Éù²¨Ä£¿é
 * @author          FengLin
 * @version         1.0
 * @Target core     CH32V103R8T6
 * @date            2021-10-07
 ********************************************************************************************************************/

#include "car_ultrasonic.h"

//-------------------------------------------------------------------------------------------------------------------
// @brief        ³¬Éù²¨Ä£¿é³õÊ¼»¯
// @param        void
// @return       void
// Sample usage:        car_ultrasonic_init();//³õÊ¼»¯³¬Éù²¨Ä£¿é
//-------------------------------------------------------------------------------------------------------------------
void car_ultrasonic_init()
{
    ultrasonic_init(pin_trig, pin_echo);
    tim_init();
    nvic_init(EXTI0_IRQn, 0, 0, ENABLE);
    nvic_init(TIM2_IRQn, 0, 1, ENABLE);
}

//-------------------------------------------------------------------------------------------------------------------
// @brief        ³¬Éù²¨²âÊÔ¾àÀë
// @param        void
// @return       distance
// Sample usage:        car_ultrasonic_getchar();//·µ»Ø³¬Éù²¨²âÊÔ¾àÀë
//-------------------------------------------------------------------------------------------------------------------
float car_ultrasonic_getchar()
{
    float distance = 0;
    sum = 0;
    for(int i = 0; i < 5; i++)
    {
        Delay_Ms(100);
        start_trig(pin_trig);
    }
    distance = sum  / 5 * 0.00001 * 340 * 100 / 2;
    printf("%d\n",sum);
    return distance;
}
