/*********************************************************************************************************************
* @file            car_buzzer.c
* @author          Andreas HF
* @Target core     CH32V103R8T6
* @revisions       -2021.10.22, V1.0
* @modify          none
********************************************************************************************************************/

#include "car_buzzer.h"

//-------------------------------------------------------------------------------------------------------------------
//@brief        buzzer 初始化(引脚对应通道见PWM 引脚初始化部分)
//@param        PWMCH                    PWM通道（参见hf_pwm.h中的枚举PWMCH_enum）
//@param        FREQ_DIV                 预分频值(0~65535)
//@return       void
//Sample usage:        buzzer_init();
//                     //buzzer初始化
//-------------------------------------------------------------------------------------------------------------------
void buzzer_init(void)
{
    pwm_init(PWMCH, FREQ_DIV, 0, TIM_OCPreload_Disable);
}

//-------------------------------------------------------------------------------------------------------------------
//@brief        buzzer 频率设置
//@param        freq              频率（20Hz-3600Hz）
//@return       
//Sample usage:        buzzer_freq(400);    //设置buzzer频率为400Hz
                       //频率计算公式：buzzer频率 = PWM信号频率 = 时钟频率（72MHz） / 预分频值 / 自动重装载值
//-------------------------------------------------------------------------------------------------------------------
void buzzer_freq(unsigned int freq)
{
    pwm_freq(PWMCH, freq);
}

//-------------------------------------------------------------------------------------------------------------------
//@brief        PWM 占空比设置
//@param        duty				     占空比（0-100）
//@return		
//Sample usage:        buzzer_duty(50);//设置buzzer输出占空比为50％
//-------------------------------------------------------------------------------------------------------------------
void buzzer_duty(unsigned char duty)
{
    pwm_duty(PWMCH, duty*100);
}
