/********************************************************************************************************************
* @file            HF_WS2812b.h
* @author          Andreas HF
* @version         1.0
* @Target core     CH32V103R8T6
* @date            -2021.10.22, V1.0
********************************************************************************************************************/

#ifndef _HF_WS2812B_H
#define _HF_WS2812B_H

#include "headfile.h"

//函数声明
/* RGB初始化 */
void ws2812b_init();
/* RGB写入 */
void ws2812b_write(uint8_t* RGB);

//全局变量声明

#endif
